class TermModel {
  String? mainTitle;
  List<String>? description;

  TermModel({this.mainTitle, this.description});

  TermModel.fromJson(Map<String, dynamic> json) {
    mainTitle = json['main_title'];
    description = json['description'].cast<String>();
  }

  Map<String, dynamic> toJson() {
    final Map<String, dynamic> data = new Map<String, dynamic>();
    data['main_title'] = this.mainTitle;
    data['description'] = this.description;
    return data;
  }
}

List<TermModel> termList = [
  TermModel(mainTitle: "1. כללי", description: [
    "1.1. ברוכים הבאים לאפליקציה אינק ישראל (להלן: האפליקציה). ",
    "1.2. האפליקציה הינה בבעלות אינק ישראל ח.פ. 434564515 (להלן: הבעלים) וכל שימוש בה על ידך כפוף להוראות תנאי השימוש להלן.",
    "1.3. בהעדר הסכמה לאילו מהתנאים הכלולים בתנאי שימוש אלו, עליך להימנע מלעשות כל שימוש באפליקציה.",
    "1.4. בבחירתך לעשות שימוש כלשהו באפליקציה הנך להסכים לתנאי שימוש אלו במלואם.",
    "1.5. הבעלים שומרים לעצמם את הזכות לשנות תנאי שימוש אלו, והנך להסכים בזאת כי בכל שימוש שלך באפליקציה לאחר המועד שבו תנאים אלו השתנו עליך לקבל על עצמך את הגרסה המעודכנת.",
    "1.6. אם הנך מתחת לגיל 13, אינך מורשה להשתמש באפליקציה זו או לבצע כל פעילות בה ללא הסכמת הוריך. על ידי לחיצה על אני מסכים, אתה מאשר שהם קראו ומסכימים להוראות תנאי שימוש אלה.",
    "1.7. האפליקציה נועדה לשימושך, בכפוף לתנאי שימוש אלו.",
    "1.8. תנאי שימוש אלו חלים על האפליקציה ו/או חלקים ממנה ועל השימוש בה ובתכנים הכלולים בה, לרבות על עיצובים, קוד מקור, מודולי תוכנה ותכנים ו/או מוצרים ו/או שירותים כלשהם של האפליקציה ו/או שהאפליקציה מאפשרת נגישות ו/או הורדה שלהם, והם מהווים חלק בלתי נפרד מהם ומתפקוד האפליקציה ו/או משירותים המוצעים בה ו/או באמצעותה, בתמורה או שלא בתמורה (להלן, ביחד ולחוד: השירותים). ",
    "1.9. הסדרת רישיונות כלשהם לצורך שימוש באפליקציה (כגון רישיון נהיגה, רישיון עסק, רישיון לעסוק בתיווך וכו') כמו גם ביטוח מכל סוג, תשלומי מיסים והוצאות והסדרה של עניינים אחרים הנובעים מהוראות החוק לצורך ביצוע פעילות עסקית או אחרת באמצעות אפליקציה זו, הנם באחריותך בלבד.",
    "1.10. השימוש במידע, במוצרים ו/או בשירותים כלשהם באמצעות האפליקציה ובכלל הינם באחריותך הבלעדית ובכפוף להוראות תנאי שימוש אלו.",
    "1.11. הנך להסכים בזאת במפורש כי הבעלים פטורים לחלוטין מכל אחריות, נזק או אי נוחות, לך או לאחרים, לגבי כל היבט של שימוש באפליקציה/במוצרים/בשירותים באמצעות האפליקציה או שיסופקו לך באמצעותה והנך לקחת את כל האחריות לכך על עצמך בלבד ולבצע את כל הבדיקות הדרושות.",
  ]),
  TermModel(mainTitle: "2. תנאי השימוש", description: [
    "2.1. תנאי שימוש אלו נועדו להבהיר מה הם התנאים החלים על כל מי שעשה, עושה ו/או יעשה שימוש באפליקציה. \n",
    "2.2. בתנאי שימוש אלו, הביטוי תוכן כולל כל שירות, מוצר, קוד מקור, מודול תוכנה, יישום תוכנה, טקסט, תצלום, תמונה, עיצוב, איור, מפה, קטע צליל, קטע וידיאו, גרפיקה, ביטוי, יצירה, ידע או מידע אחר, בשלמותם ו/או בחלקם, המוצגים באפליקציה זו ו/או שימשו לתכנונה/אפיונה ו/או המוזנים אליה ו/או הכלולים בה ו/או הממוענים אליה/ממנה, וזאת בכל אמצעי תקשורת ו/או קשר, בין בתשלום ובין בלא תשלום, על ידך ו/או צד שלישי כלשהו, וכן כל זכות קניין רוחני, לרבות, אך לא רק, פטנטים, סימני מסחר זכויות יוצרים וזכויות וסריות, המתייחסות לאלו מהם.\n",
    "2.3. כל שימוש שייעשה בתנאי שימוש אלו בלשון זכר או בלשון נקבה הינו לצרכי נוחות בלבד, והפנייה היא לנשים ולגברים כאחד. כמו-כן, כל פניה ליחיד משמעה גם פנייה לרבים ולהפך.\n",
    "2.4. הוראות תנאי שימוש אלו הן מצטברות ו/או חלופיות ו/או משלימות, לפי העניין והקשר הדברים."
  ]),
  TermModel(mainTitle: "3. הגישה לאפליקציה", description: [
    "3.1. הבעלים שומרים לעצמם את הזכות לאפשר או לא לאפשר שימוש באפליקציה בכל עת,וכן לשנות ו/או להפסיק לעשות כן, והכל לפי שיקול דעתם הבלעדי.\n",
    "3.2.  יכול שהגישה לאפליקציה או חלקה, והאפשרות לבצע פעולות מסוימות, תתאפשר למשתמשים מסוימים אך תהא מוגבלת למשתמשים אחרים, מסיבות כאלה ואחרות, או לא תתאפשר כלל ו/או תהא כרוכה בהקצאת שם משתמש ו/או סיסמה ו/או תהא מותנית במילוי שאלון ו/או מסירת פרטים אישיים,הכל לפי שיקול דעתם המוחלט והבלעדי של הבעלים.\n",
    "3.3. הבעלים יוכלו להתחיל לדרוש זאת ללא הודעה מוקדמת, או להוסיף לדרוש זאת, או להפסיק לדרוש זאת, או לעשות כן מדי פעם בפעם, ללא הודעה מוקדמת, ולפי שיקול דעתם המוחלט והבלעדי."
  ]),
  TermModel(mainTitle: "3. הגישה לאפליקציה", description: [
    "3.1. הבעלים שומרים לעצמם את הזכות לאפשר או לא לאפשר שימוש באפליקציה בכל עת,וכן לשנות ו/או להפסיק לעשות כן, והכל לפי שיקול דעתם הבלעדי.",
    "3.2.  יכול שהגישה לאפליקציה או חלקה, והאפשרות לבצע פעולות מסוימות, תתאפשר למשתמשים מסוימים אך תהא מוגבלת למשתמשים אחרים, מסיבות כאלה ואחרות, או לא תתאפשר כלל ו/או תהא כרוכה בהקצאת שם משתמש ו/או סיסמה ו/או תהא מותנית במילוי שאלון ו/או מסירת פרטים אישיים,הכל לפי שיקול דעתם המוחלט והבלעדי של הבעלים.",
    "3.3. הבעלים יוכלו להתחיל לדרוש זאת ללא הודעה מוקדמת, או להוסיף לדרוש זאת, או להפסיק לדרוש זאת, או לעשות כן מדי פעם בפעם, ללא הודעה מוקדמת, ולפי שיקול דעתם המוחלט והבלעדי."
  ]),
  TermModel(mainTitle: "4. שימוש במידע שמסרת", description: [
    "4.1. אם מסרת כתובת דואל (email), הנך מסכים בזאת לקבל הודעות לכתובת דואל אותה מסרת לצרכים שונים, ובכלל זה פרסומות, הזמנות, הצעות הודעות ומסרים מסחריים מכל סוג. הנך רשאי לבקש להפסיק שיגור של הודעות כאמור בהתאם להוראות כל דין.",
    "4.2. עי השימוש באפליקציה הנך להסכים בזאת לאיסוף והתחקות אחר נתונים, מידע, תוכן, פעולות והרגלי שימוש שלך ואלו ישמשו לצרכים שונים, לרבות מסחריים ושיווקיים."
  ]),
  TermModel(mainTitle: "5. סוגי התכנים באפליקציה", description: [
    "5.1. הבעלים שומרים לעצמם את הזכות לבחור האם ואלו תכנים יופיעו ו/או יפורסמו, או יפסיקו/יוסיפו להופיע ו/או להתפרסם באפליקציה, או יופיעו/יתפרסמו מדי פעם בפעם, הכל לפי שיקול דעתם הבלעדי והמוחלט, ולפי צרכיהם המסחריים, וללא הודעה מראש או עדכון בדיעבד.",
    "5.2. הבעלים עשויים לשנות, להוסיף, לגרוע, למחוק ולעדכן מעת לעת את תכני האפליקציה ו/או מראה האפליקציה ו/או אופן הפעלתה ו/או אופן השימוש בה ו/או מוצרים ו/או שירותים הכלולים בה, ללא הודעה מוקדמת ולפי שיקול דעתם הבלעדי.",
    "5.3. הבעלים שומרים לעצמם את הזכות לכלול באפליקציה תכנים המהווים פרסומות שלהם ו/או של אחרים ו/או תכנים מסחריים אחרים כלשהם (להלן: פרסומות).",
    "5.4. תמונות, אילוסטרציות והדמיות המופיעות באפליקציה הינן להמחשה בלבד, ואינן מחייבות את הבעלים.",
    "5.5. הפרסומות שיופיעו באפליקציה ו/או שיישלחו למשתמשים בה, הינן באחריות המלאה והבלעדית של המפרסמים.",
    "5.6. בתכני האפליקציה עלולות ליפול שגיאות לרבות במועדים, מחירים, תנאי תשלום ועוד, והבעלים שומרים על זכותם לתקן כל טעות כאמור בכל עת."
  ]),
  TermModel(mainTitle: "6. חיפוש תכנים באפליקציה", description: [
    "הבעלים שומרים לעצמם את הזכות להפעיל דרכי גישה, אמצעי חיפוש ו/או מנועי חיפוש באפליקציה, שיאפשרו גישה לתכנים מסוימים באפליקציה או חלק ממנה עפי בחירת, וכן לשנות ו/או להפסיק לעשות כן, והכל לפי שיקול דעתם הבלעדי.",
  ]),
  TermModel(mainTitle: "7. זמינות תכנים באפליקציה", description: [
    "הנך לאשר כי יתכנו תקלות כאלה ואחרות, הנובעות מסיבות כאלה ואחרות, העלולות למנוע את הגישה ו/או השימוש באפליקציה, או להכביד עליהם, לרבות עקב קשיי תקשורת ו/או לשם תחזוקה ו/או מטעמים אחרים, ויכול שהשימוש באפליקציה ייקטע ו/או יופסק ללא השלמה ו/או שמירה. הבעלים יהיו פטורים מכל אחריות לכך, ועליך לשמור מראש כל מידע שבדעתך לעשות בו שימוש או להזין לאפליקציה, בטרם עשותך כן.",
  ]),
  TermModel(mainTitle: "8. תפקוד מכשירים", description: [
    "מבלי לגרוע מן האמור לעיל, הנך מאשר כי ידוע לך כי במקרים מסוימים השימושיות של האפליקציה תלויה בתפקוד תקין של מכשיר הסמארטפון שברשותך ורכיבים הכלולים בו כי GPS, BlueTooth ועוד. אשר איכותם, אי דיוקם, שיבוש בהם ותקלות, עלולים להפריע לחווית השימוש שלך באפליקציה. הבעלים יהיו פטורים מכל אחריות לכך."
  ]),
  TermModel(
      mainTitle: "9. תשלומים אשר יכול שיבוצעו דרך האפליקציה",
      description: [
        "מחירים באפליקציה, ככל שיהיו כאלה, נכונים למועד הצגתם, ועשויים להתעדכן ולהשתנות מעת לעת לפי שיקול דעת הבעלים ו/או לפי שיקול דעת המפרסמים."
      ]),
  TermModel(mainTitle: "10. הזנת תכנים לאפליקציה", description: [
    "10.1. אם במסגרת שימוש באפליקציה, חיפוש, הזמנת מוצרים ו/או, שירותים ו/או פעילות אחרת באמצעות האפליקציה, האפליקציה תאפשר לך להזין מידע ו/או תכנים כלשהם, האחריות על תכנים אלו,",
    "משמעותם ועצם הזנתם תחול עליך בלבד.",
    "10.2. מבלי לגרוע מהאמור לעיל, אין להזין לאפליקציה ו/או להפיץ ממנה ו/או באמצעותה תוכן כלשהו שעלול לפגוע באדם כלשהו, שמו הטוב, פרטיותו, קנייניו או זכויותיו, ואין להזין תכנים לאפליקציה בניגוד להוראות תנאי שימוש אלו ו/או הוראות כל דין.",
    "10.3. הבעלים שומרים לעצמם את הזכות, לערוך, לשנות ואף למחוק תכנים כאלו. הנך לתת בזאת את הסכמתך המפורשת לעריכת שינויי תוכן ו/או עריכה ו/או מחיקה של תכנים כלשהם שהוזנה לאפליקציה.",
    "10.4. זו זכותך לפנות לבעלים ולבקש מחיקה של תכנים שהזנת לאפליקציה והבעלים ישתדלו למלא אחר בקשתך, אולם הם אינם מתחייבים לעשות כן.",
    "10.5. האחריות לכל מעשה או מחדל שאינם  עולים בקנה אחד עם האמור לעיל הינה עליך בלבד.",
  ]),
  TermModel(mainTitle: "11. קישורים, פרסומות והפניות מהאפליקציה", description: [
    "באפליקציה יכול שתהיה הפניה לתכנים, פרסומות ומקורות שאינם בשליטה ו/או פיקוח של הבעלים. לפיכך אם יופיע בהם חומר פוגעני, בלתי מוסרי, בלתי חוקי, או אם ייגרם באמצעותם ו/או בגינם נזק מכל סוג, אזי לבעלים ו/או מי מטעמם אין ולא תהא כל אחריות על כך.",
  ]),
  TermModel(mainTitle: "12. זכויות בעלות וזכויות קניין רוחני", description: [
    "12.1. זכויות הקניין הרוחני מוגנות בישראל ובחול מכוח חוקי מדינת ישראל ואמנות בינלאומיות.",
    "12.2. הבעלים מכבדים זכויות בעלות וזכויות קניין רוחני של אחרים, וגם עליך לעשות כן.",
    "12.3. אפליקציה זו ותכניה הם הרכוש הבלעדי של בעלי זכויות הקניין בהם, ואינם רכושך, ואין לעשות בהם כל שימוש אלא בכפוף לתנאי שימוש אלו.",
    "12.4. אלא אם הוסכם במפורש אחרת מראש ובכתב, יש לראות את המידע ו/או זכויות הקניין הרוחני באפליקציה כשל הבעלים בלבד ו/או כמותרים לשימוש הבעלים עי צדדים שלישיים, ובכלל זה זכויות",
    "יוצרים, זכויות מוסריות, סימני מסחר, סימני שרות, שמות מסחריים, מדגמים, פטנטים, יצירות, עיצובים, המצאות, סודות מסחריים, מידע טכנולוגי, מידע פונקציונאלי, מידע מקצועי, מידע מסחרי ועסקי, וכל מידע ו/או זכות קניין רוחני, ועסקי, בין שנרשמה, ובין שלא נרשמה (להלן: זכויות הקניין הרוחני).",
    "12.5. צדדים שלישיים בעלי זכויות קניין רוחני בתכנים שהוזנו לאפליקציה ללא ידיעת הבעלים של ו/או הסכמתם, מתבקשים לפנות לבעלים ו/או למי מטעמם ולדווח להם על כך.",
    "12.6. הבעלים שומרים לעצמם את הזכות לאכוף, להסיר, לשנות, לתקן ולמנוע כל שימוש ו/או הזנה לאפליקציה ו/או פרסום של תכנים המפרים זכויות קניין רוחני שלהם ו/או של צדדים שלישיים, ולדרוש כל פיצוי ו/או שיפוי מכל מי שעלול להעמיד את עצמו ו/או את הבעלים במצב של הפרה אפשרית של זכויותיהם ו/או של אחרים."
  ]),
  TermModel(mainTitle: "13. שימוש בתכני האפליקציה", description: [
    "13.1. אין לעשות באפליקציה ו/או בתכניה כל שימוש פוגעני באדם כלשהו, שמו הטוב, פרטיותו, או זכויותיו, ואין לעשות שימוש כלשהו באפליקציה ו/או בתכניה שהינו בניגוד לתנאי שימוש אלו ו/או הוראות כל דין, נוהג, או תקנת הציבור.",
    "13.2. כל שימוש באפליקציה ו/או בתכנים כלשהם הכלולים בה ו/או נלקחו ממנה, הינם לשימוש אישי בלבד, ואין לעשות כל שימוש אחר לרבות עסקי, שיווקי או מסחרי,  אלא אם יותר לעשות כן עי הבעלים במפורש,  מראש ובהיתר בכתב, ובהתאם לתנאי ההיתר, כאמור בגוף האפליקציה.",
    "13.3. בכלל זה, ומבלי לגרוע מכלליות האמור לעיל, אין לנצל איזו מזכויות הקניין הרוחני של הבעלים ו/או צד שלישי ללא הסכמתם, לרבות, אך לא רק, בדרך של גזירה, העתקה, שמירה כקובץ, שכפול, הפצה, עיבוד, מחיקה, תוספת, שינוי, מכירה, השכרה, השאלה, מסירה, הצגה פומבית, ביצוע פומבי, יצירת יצירה נגזרת, או כל דרך אחרת.",
    "13.4. העושה כן ללא היתר מפורש מאת הבעלים, מראש ובכתב, ככל שיינתן ובכפוף לתנאיו, מסתכן בהעמדה לדין פלילי ובהליכים אזרחיים, לרבות צווי מניעה, חיפוש, תפיסה, תביעות כספיות, עיכוב טובין, מעצר, מאסר וכל אמצעי אכיפה אחר ו/או נוסף שהבעלים ימצאו לנכון.",
    "13.5. אין ולא יהיה בהיתר שיינתן לך עי הבעלים לעשות שימוש בתכנים כלשהם באפליקציה, אם וככל שיינתן, כדי לגרוע מזכויות הבעלים, לרבות זכויות בעלות בכלל, וזכויות הקניין הרוחני בפרט, ולא ישתמע ממעשה או מחדל כלשהו של הבעלים משום הסכמה להעברה ו/או למתן שימוש בזכות קניין רוחני כלשהי או זכות אחרת לבעל ההיתר או לאדם אחר, אלא אם הוסכם על כך במפורש,  מראש ובכתב, ובכפוף לזכויות השייכות לבעלים, או שהאחרונים קיבלו מצדדים שלישיים, ובכפוף להוראות כל דין.",
    "13.6. מבלי לגרוע מהאמור לעיל, שימוש הוגן ביצירה, כמשמעותו בכל דין הינו מותר למטרת לימוד עצמי, מחקר, ביקורת, סקירה, דיווח, עיתונאי, הבאת מובאות, הוראה ובחינה על ידי מוסד חינוך, בכפוףלכל דין בישראל בלבד. בכל שימוש הוגן, חובה לתת קרדיט למחבר התוכן ולאפליקציה. אין להטיל בתוכן כל פגם, או לעשות בו כל סילוף או שינוי צורה אחר, או פעולה פוגענית אחרת, אם יש באילו מהם כדי לפגוע בכבודו או בשמו של היוצר. ",
  ]),
  TermModel(mainTitle: "14. פטור מאחריות", description: [
    "14.1. האפליקציה והתכנים הכלולים בה, מוצגים ומוצעים לשימוש במצבם כפי שהוא (As Is).",
    "14.2. הבעלים לא יישאו באחריות כלשהי, חוזית ו/או נזיקית ו/או אחרת, לשימוש כלשהו שייעשה באפליקציה ו/או בישומייה, ו/או למניעה ו/או להפרעה משימוש באפליקציה מסיבה כלשהי.",
    "14.3. הבעלים לא יישאו באחריות כלשהי לתכנים שיימסרו או יוזנו על ידך, חוקיותם, אמינותם, מהימנותם, דיוקם, שלמותם, קבצי מחשב שיצורפו אליהם, ולכל נזק, הפסק, עגמת נפש או תוצאות, במישרין או בעקיפין, לך ו/או לצד שלישי כלשהו.",
    "14.4. הבעלים לא יישאו בכל אחריות לכל נזק עקב הורדת האפליקציה ו/או נזק שנבע מקישור הכלול באפליקציה ולכל נזק שנבע מהצגה או מפרסום של תכנים כאמור בכל דרך אחרת. כמו כן, אחריות המלאה והבלעדית לכל קישור, הצגה או פרסום של התכנים שנעשו על ידך הנם עליך והנך להתחייב בזאת לשפות את הבעלים בגין כל נזק שייגרם כתוצאה מכך.",
    "14.5. הבעלים לא מתחייבים לשמור תכנים כלשהם שהזנת לאפליקציה, ו/או שהורדת מהאפליקציה, והאחריות על שמירת תכנים באמצעים שלך, הינם בלתי תלויים בבעלים ו/או באפליקציה ו/או במי הקשור עימם, והיא עליך בלבד. שמירת תכנים כאלו הינה בכפוף להוראות כל דין ותנאי שימוש אלו.",
    "14.6. הנך להצהיר בזאת כי כל אחריות וסיכון לכל נזק ו/או הפסד שייגרמו לך בגין השימוש באפליקציה הינם עליך,לרבות: תאונות, עוגמת נפש, היבטים כלכליים וכל נזק אחר. כן יצוין כי השימוש במכשיר הנייד בזמן נסיעה הינו אסור ומסוכן לך ולסביבתך. "
  ]),
  TermModel(mainTitle: "15. שיפוי", description: [
    "הנך להתחייב לשפות ולפצות את הבעלים ו/או כל מי מטעמם, בגין כל מעשה ו/או מחדל שגרם לבעלים נזק ישיר או עקיף, הפסד, אבדן-רווח, תשלום או הוצאה, בין עקב הפרת תנאי שימוש אלו, בין עקב הפרת הוראות כל דין, ובין עקב כל טענה או תביעה מצד שלישי כלשהו."
  ]),
  TermModel(mainTitle: "16. סמכות שיפוט", description: [
    "דיני מדינת ישראל בלבד יחולו על הוראות תנאי שימוש אלו ופרשנותם, ומקום הבוררות והשיפוט יהיו בבית המשפט המוסמך במחוז תל אביב או מחוז מרכז בלבד.",
  ]),
  TermModel(mainTitle: "17. שינויים בתנאי שימוש", description: [
    "יכול שבהוראות תנאי שימוש אלו יחולו מעת לעת שינויים, עדכונים, תוספות, מחיקות, לפי שיקול דעתם המוחלט והבלעדי של הבעלים, עליהם תפורסם הודעה. אם הינך מעוניין להמשיך לעשות שימוש באפליקציה זו, ייראו אותך כמסכים לתנאים המתוקנים, אלא אם הם יעמדו בסתירה להוראות החוק."
  ]),
  TermModel(mainTitle: "18. פנו אלינו", description: [
    "נשתדל לטפל בפניות מתאימות אלינו בהקדם האפשרי. פניות כאמור יש להעביר לפי הפרטים להלן:"
  ])
];

List<TermModel> privacyList = [
  TermModel(mainTitle: "1. כללי", description: [
    "1.1. מדיניות פרטיות זו היא חלק בלתי נפרד מתנאי השימוש לאפליקציה אינק ישראל (להלן: האפליקציה) בבעלות שפע – אינק ישראל (להלן: הבעלים) וכל שימוש בה על ידך כפוף להוראות תנאי השימוש להלן.",
    "1.2. מטרת מדיניות הפרטיות היא לפרט בפניך, המשתמש/ת, כיצד נאספים עליך נתונים באמצעות האפליקציה, מה מטרת השימוש וכיצד נעשה בהם שימוש, אם בכלל.",
    "1.3. הוראות מסמך זה יפורשו בהתאם לדיני מדינת ישראל בלבד. בכל מקרה של סכסוך, מקומו של הליך יהיה בבית המשפט המוסמך במחוז תל-אביב או מחוז המרכז בלבד, והמותב הרלבנטי ידון בו עפי דיני מדינת ישראל בלבד.",
    "1.4 הוראות מדיניות הפרטיות יחולו על האפליקציה יחד עם שינויים, עדכונים, תוספות, או מחיקות, כפי שיבוצעו מדי פעם בפעם על פי שיקול דעתו המוחלט והבלעדי של הבעלים, בהודעה שתפורסם (להלן: השינויים). המשך שימוש באפליקציה לאחר שינויים אלו יחשב כהסכמה לתנאים המתוקנים, אלא אם כן הם סותרים הוראות קוגנטיות (בלתי ניתנות להתניה) של הדין הישראלי.",
  ]),
  TermModel(mainTitle: "2. מדיניות הפרטיות שלנו", description: [
    "2.1. אנו שומרים לעצמנו את הזכות לאפשר גישה לאפליקציה על ידי תהליך רישום או על ידי אמצעי רישום שמעמידים צדדים שלישיים כגון פייסבוק.",
    "2.2. בתהליך הרשמה, תשלום, או תהליך הזנה אחר באפליקציה, ייתכן שיהיה עליך להזין פרטים כמו שמך, כתובת הדואר האלקטרוני, כתובת דואר, כרטיס אשראי או פרטים אחרים לפי העניין, אותם אנו אוספים.",
    "2.3.  אנו עשויים להשתמש במידע שאנו אוספים ממך כאמור בעת רישום, ביצוע רכישה, הרשמה לניוזלטר שלנו, בעת עריכת סקר שיווק, או באחד או יותר מהמקרים הבאים:",
    "2.3.1. כדי להתאים אישית את חווית המשתמש שלך וכדי לאפשר לנו לספק לך את השירות או המוצר שבו יש לך עניין, או ",
    "2.3.2. כדי לעבד את העסקאות שלך במהירות האפשרית.",
    "2.4. האפליקציה נבדקת על בסיס קבוע כדי לאתר חורי אבטחה ונקודות תורפה ידועות על מנת להפוך את השימוש בה עבורך בטוח ככל האפשר.",
    "2.5. אנו מיישמים מגוון של אמצעי אבטחה כאשר משתמשים אחרים עושים שימוש באפליקציה כדי להבטיח שלא תהיה להם נגישות אלא למידע שלהם ותוך שמירת המידע האישי שלך מפניהם.",
    "2.6.  עסקות שמבוצעות באמצעות האפליקציה אינן מעובדות באפליקציה עצמה, אלא אצל גורמים מומחים לכך, והן אינן מאוחסנות על השרתים שלנו."
  ]),
  TermModel(mainTitle: "3. צדדים שלישיים", description: [
    "3.1. אנחנו לא מוכרים, סוחרים, או מעבירים לגורמים חיצוניים את פרטיך האישיים, למעט אלו שהסכמת מראש. ",
    "3.2. אנו עשויים לאפשר פרסומות באפליקציות שלנו.",
    "3.3. אנו נעשה את המירב כדי לא לאפשר לצדדים שלישיים לבצע מעקב אחריך."
  ]),
  TermModel(mainTitle: "4. פנו אלינו", description: [
    "נשתדל לטפל בפניות מתאימות אלינו בהקדם האפשרי. פניות כאמור יש להעביר לפי הפרטים להלן:",
  ])
];
